backend/app/models/stock_card.rb

SELECT  "watch_lists".* FROM "watch_lists" WHERE "watch_lists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "stock_cards".* FROM "stock_cards" WHERE "stock_cards"."watch_list_id" = $1  [["watch_list_id", 16]]
SELECT "stock_cards".* FROM "stock_cards" WHERE "stock_cards"."watch_list_id" = $1  [["watch_list_id", 4]]
---
    def unique_stock
        watch_list = WatchList.find(self.watch_list_id)
        watch_list.stock_cards.each do |stock_card|