backend/app/controllers/stock_cards_controller.rb

SELECT "stock_cards".* FROM "stock_cards"
---
	def index
        @stock_cards = StockCard.all

INSERT INTO "stock_cards" ("watch_list_id", "symbol") VALUES ($1, $2) RETURNING "id"  [["watch_list_id", 5], ["symbol", "AAPL"]]
---
    def create
        byebug
        @stock_card = StockCard.create(stock_card_params)

SELECT  "stock_cards".* FROM "stock_cards" WHERE "stock_cards"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "stock_cards" WHERE "stock_cards"."id" = $1  [["id", 16]]
---
    def destroy
        @stock_card = StockCard.find(params[:id])
        @stock_card.destroy