backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name") VALUES ($1) RETURNING "id"  [["name", "user_test"]]
---
    def create
        @user = User.create(user_params)