backend/app/controllers/watch_lists_controller.rb

    def index
        @watch_lists = WatchList.all
---
SELECT "watch_lists".* FROM "watch_lists"

    def show
        @watch_list = WatchList.find(params[:id])
---
SELECT  "watch_lists".* FROM "watch_lists" WHERE "watch_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @watch_list = WatchList.create(watchlist_params)
---
INSERT INTO "watch_lists" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "testlist"], ["user_id", 2], ["created_at", "2019-07-31 21:01:31.860592"], ["updated_at", "2019-07-31 21:01:31.860592"]]

    def update
        @watch_list = WatchList.find(params[:id])
        @watch_list.update(watchlist_params)
---
SELECT  "watch_lists".* FROM "watch_lists" WHERE "watch_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "watch_lists" SET "name" = $1, "updated_at" = $2 WHERE "watch_lists"."id" = $3  [["name", "new test list"], ["updated_at", "2019-07-31 23:39:55.064765"], ["id", 2]]

    def destroy
        @watch_list = WatchList.find(params[:id])
        @watch_list.destroy
---
SELECT  "watch_lists".* FROM "watch_lists" WHERE "watch_lists"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "watch_lists" WHERE "watch_lists"."id" = $1  [["id", 6]]